Repository: Blezz-tech/nushell-translate-docs-ru
Catalog: nushell-translate-docs-ru-level2.tmx
Source language: en_us
Languages: ru_ru

source: Then, because Nushell takes some design decisions that are quite different from typical shells or dynamic scripting languages, make sure to check out Thinking in Nu where we explain some of these concepts.
ru_ru: Затем, поскольку в Nushell приняты некоторые дизайнерские решения, сильно отличающиеся от типичных оболочек или динамических скриптовых языков, обязательно ознакомьтесь с разделом Мышление в Nu, где мы объясняем некоторые из этих концепций.

source: There are a couple of assignment operators used with mutable variables
ru_ru: Существует несколько операторов присваивания, используемых с изменяемыми переменными

source: There are multiple ways to convert strings to and from other types.
ru_ru: Существует множество способов преобразования строк в другие типы и обратно.

source: There are various ways to pre, or append strings.
ru_ru: Существуют различные способы предварительной обработки или добавления строк.

source: These correspond to the single-quoted and double-quoted strings: single-quoted string interpolation doesn't support escape characters while double-quoted string interpolation does.
ru_ru: Они соответствуют строкам с одинарными и двойными кавычками: интерполяция строк с одинарными кавычками не поддерживает управляющие символы, а интерполяция строк с двойными кавычками - поддерживает.

source: These let you insert to the beginning of a list or at the end of the list, respectively.
ru_ru: Они позволяют вставить в начало списка или в его конец, соответственно.

source: These look very similar!
ru_ru: Они очень похожи!

source: They have a startpoint and an endpoint.
ru_ru: У них есть начальная и конечная точки.

source: This acts as a handy way to get to a single row.
ru_ru: Это удобный способ перехода к одному ряду.

source: This applies generic column names to the table.
ru_ru: При этом к таблице применяются общие имена столбцов.

source: This can be called multiple times to flatten lists nested at any depth.
ru_ru: Эту функцию можно вызывать несколько раз, чтобы сгладить списки, вложенные на любую глубину.

source: This can include file names, file paths, names of columns, and much more.
ru_ru: Это могут быть имена файлов, пути к ним, имена столбцов, и многое другое.

source: This chapter covers those two topics:
ru_ru: Эта глава посвящена этим двум темам:

source: This chapter intends to give more in-depth overview of certain aspects of Nushell's design.
ru_ru: В этой главе мы намерены дать более подробный обзор некоторых аспектов дизайна Nushell.

source: This helps to create a table that's more focused on what we need.
ru_ru: Это помогает создать таблицу, которая в большей степени ориентирована на то, что нам нужно.

source: This is a way of building text from both raw text and the result of running expressions.
ru_ru: Это способ создания текста как из исходного текста, так и из результатов выполнения выражений.

source: This lets us do many different types of work in our pipeline until we're ready to write out the result with any changes we'd like if we choose to.
ru_ru: Это позволяет нам выполнять множество различных видов работ в нашем конвейере до тех пор, пока мы не будем готовы написать результат с любыми изменениями, которые мы захотим, если захотим.

source: This metadata can be used, for example, to create custom errors.
ru_ru: Эти метаданные можно использовать, например, для создания пользовательских ошибок.

source: This visual may be slightly confusing, because it looks like what we've just done is add a row.
ru_ru: Это изображение может немного смутить, потому что кажется, что мы только что добавили строку.

source: Those familiar with Bash and Perl will recognise the regex comparison operators:
ru_ru: Те, кто знаком с Bash и Perl, узнают операторы сравнения regex:

source: Thus, rather than being either a shell, or a programming language, Nushell connects both by bringing a rich programming language and a full-featured shell together into one package.
ru_ru: Таким образом, Nushell не является ни оболочкой, ни языком программирования, а соединяет в себе и то, и другое, объединяя в одном пакете богатый язык программирования и полнофункциональную оболочку.

source: To further explore the data-centric direction, Nushell includes a full-featured dataframe processing engine using Polars as the backend.
ru_ru: Для дальнейшего развития направления, ориентированного на данные, Nushell включает в себя полнофункциональный механизм обработки фреймов данных, использующий Polars в качестве бэкенда.

source: To see it in action let's open the same file:
ru_ru: Чтобы увидеть его в действии, откроем тот же файл:

source: To start off, let's get a table that we can use:
ru_ru: Для начала давайте создадим таблицу, которую мы сможем использовать:

source: To use mutable variables for such behaviour, you are encouraged to use the loops
ru_ru: Чтобы использовать изменяемые переменные для такого поведения, рекомендуется использовать циклы

source: Two other operators exist for simpler comparisons:
ru_ru: Для более простых сравнений существуют два других оператора:

source: Unlike file redirections, pipe redirections do not apply to all commands inside an expression.
ru_ru: В отличие от перенаправления файлов, перенаправление конвейеров не применяется ко всем командам внутри выражения.

source: Using string interpolation.
ru_ru: Использование строчной интерполяции.

source: Values in Nushell contain some extra metadata.
ru_ru: Значения в Nushell содержат некоторые дополнительные метаданные.

source: Variable names in Nushell come with a few restrictions as to what characters they can contain.
ru_ru: Имена переменных в Nushell имеют несколько ограничений на то, какие символы они могут содержать.

source: Variables can be immutable, mutable, or a parse-time constant.
ru_ru: Переменные могут быть неизменяемыми, изменяемыми или константами времени парсинга.

source: We can select data from a table by choosing to select specific columns or specific rows.
ru_ru: Мы можем выбирать данные из таблицы, выбирая конкретные столбцы или конкретные строки.

source: We can sort a table by any column that can be compared.
ru_ru: Мы можем отсортировать таблицу по любому столбцу, который можно сравнить.

source: We could join all three tables together like this:
ru_ru: Мы можем объединить все три таблицы следующим образом:

source: We intend to expand this chapter in the future.
ru_ru: В будущем мы намерены расширить эту главу.

source: We may want to combine tables, add new columns, or edit the contents of a cell.
ru_ru: Мы можем захотеть объединить таблицы, добавить новые столбцы или изменить содержимое ячейки.

source: We now have the values for each of the filenames.
ru_ru: Теперь у нас есть значения для каждого из имен файлов.

source: We welcome contributions!
ru_ru: Мы приветствуем вклад в развитие!

source: We've narrowed it to three rows we care about.
ru_ru: Мы сузили круг до трех рядов, которые нас волнуют.

source: While currently under-utilized, we expect to use it more as we get closer to and beyond 1.0.
ru_ru: Хотя в настоящее время он недостаточно используется, мы ожидаем увеличения его использования по мере приближения и превышения версии 1.0.

source: While the "Advanced" title might sound daunting and you might be tempted to skip this chapter, in fact, some of the most interesting and powerful features can be found here.
ru_ru: Хотя название «Продвинутый» может показаться пугающим, и у вас может возникнуть соблазн пропустить эту главу, на самом деле здесь можно найти некоторые из самых интересных и мощных функций.

source: You can interactively explore data with the explore command.
ru_ru: Вы можете интерактивно исследовать данные с помощью команды explore.

source: You can also use a regex to replace the beginning or end of a string:
ru_ru: Вы также можете использовать регулярное выражение для замены начала или конца строки:

source: You can also use reduce:
ru_ru: Вы также можете использовать комманду reduce:

source: You can click on the chapter headers to get more information about it.
ru_ru: Вы можете нажать на заголовки глав, чтобы получить более подробную информацию о них.

source: You can contribute to Nushell just by using Nushell!
ru_ru: Вы можете внести свой вклад в развитие Nushell, просто используя Nushell!

source: You could say that Nushell is a "data-first" shell and a programming language.
ru_ru: Можно сказать, что Nushell - это "ориентированная на данные" оболочка и язык программирования.

source: You may have wondered why the rows of the table are numbers.
ru_ru: Возможно, вы задались вопросом, почему в строках таблицы стоят числа.
